int a=4;   //Число
int b=-3;   //Число
int c=7;    //Число
//Проерка числа 4
Console.Write("Число=");                   // Ввыводит слово число
Console.Write(a );                         // Выводит число 4
Console.WriteLine(a%2 == 0 ? " Чет":" Нечет");                // проверяет остаток  4/2 
//Проверка числа -3
Console.Write("Число=");                   // Ввыводит слово число
Console.Write(b );                         // Выводит число 3
Console.WriteLine(b%2 == 0 ? " Чет":" Нечет");                // проверяет остаток  3/2 
// Проверка чисдл 7
Console.Write("Число=");                   // Ввыводит слово число
Console.Write(c );                         // Выводит число 7
Console.WriteLine(c%2 == 0 ? " Чет":" Нечет");                // проверяет остаток  7/2 

