int i = 1;                                           //Вводим число 1
while (i < 6)                                        // Условия что i < 6
{   
    Console.Write(i%2 == 0 ? "Чет=":"Нечет=");         //Проверяем i на чет и нечет
    Console.WriteLine(i);                               // выводим i
    i++;                                               // i+1 до тех пор пока выполняет условия 
}

Console.WriteLine("_____________________________________________");   // Разделительная полоса :D

int a = 1;                                           //Вводим число 1
while (a < 9)                                        // Условия что a < 9
{   
    Console.Write(a%2 == 0 ? "Чет=":"Нечет=");         //Проверяем a на чет и нечет
    Console.WriteLine(a);                               // выводим a
    a++;                                               // a+1 до тех пор пока выполняет условия 
}


// Все лицо в ошибках было пока это писал. ЭТИ ЯЗЫКИ "С" ПРИДУМАЛ САТАНА !!!